writePatchCentres/cavity/system/totalPressureIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the total pressure field for a case where the solver is
    incompressible (pressure is kinematic, e.g. m^2/s^2).

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/pressure/totalPressureIncompressible.cfg"

pRef    0.0;
rhoInf  1.2;

// ************************************************************************* //
